In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sklearn
from sklearn import model_selection, tree, metrics,svm
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split, GridSearchCV, KFold, cross_val_score
from sklearn.metrics import mean_squared_error, mean_squared_log_error, roc_auc_score
from sklearn.preprocessing import Normalizer, StandardScaler
from math import sqrt
import warnings
warnings.filterwarnings("ignore")

train = pd.read_excel("ThreeCars.xlsx")
train

    Price  Age  Mileage  Porsche  Jaguar  BMW
0    69.4    3     21.5        1       0    0
1    56.9    3     43.0        1       0    0
2    49.9    2     19.9        1       0    0
3    47.4    4     36.0        1       0    0
4    42.9    4     44.0        1       0    0
..    ...  ...      ...      ...     ...  ...
85   26.9    6     68.1        0       0    1
86   30.0    6     46.8        0       0    1
87   36.0    5     46.8        0       0    1
88   38.0    4     36.1        0       0    1
89   13.8    7     59.0        0       0    1

[90 rows x 6 columns]

In [2]:
train.isnull().sum()

Price      0
Age        0
Mileage    0
Porsche    0
Jaguar     0
BMW        0
dtype: int64

In [3]:
y = pd.DataFrame(train['Price'], columns=['Price'])
y

    Price
0    69.4
1    56.9
2    49.9
3    47.4
4    42.9
..    ...
85   26.9
86   30.0
87   36.0
88   38.0
89   13.8

[90 rows x 1 columns]

In [4]:
X = train.drop(['Price'], axis=1)
X

    Age  Mileage  Porsche  Jaguar  BMW
0     3     21.5        1       0    0
1     3     43.0        1       0    0
2     2     19.9        1       0    0
3     4     36.0        1       0    0
4     4     44.0        1       0    0
..  ...      ...      ...     ...  ...
85    6     68.1        0       0    1
86    6     46.8        0       0    1
87    5     46.8        0       0    1
88    4     36.1        0       0    1
89    7     59.0        0       0    1

[90 rows x 5 columns]

In [5]:
test_size = 0.3
seed = 3
X_train, X_valid, y_train, y_valid = model_selection.train_test_split(X, y, test_size = test_size, random_state = seed)

In [6]:
lg = LinearRegression()

In [7]:
lg.fit(X_train, y_train)
y_pred = lg.predict(X_valid)
rmse = sqrt(mean_squared_error(y_valid, y_pred))

In [8]:
metrics.r2_score(y_valid,y_pred)

0.7824348408794863

### Question 1. What is the value of R Squared?

#### Option c is the answer (0.78)

In [9]:
test = pd.read_excel("ThreeCarsPredicted.xlsx")
test

   Age  Mileage  Porsche  Jaguar  BMW
0    3       43        1       0    0

In [10]:
pred = lg.predict(test)
pred

array([[50.43020456]])

### Question 2. What is the value of Price for these input parameters?

#### Option a is the answer (50.22)

### Question 3. All large cities are concerned about parking space and pollution due to the number of private vehicles. A survey found the information provided below. Which of the predictor causes the maximum change in the 'number of vehicles' (dependent variable) per unit increase?

#### Option a is the answer (Gas Price). Since the gas price has the highest coefficient but negative, so gas price causes the maximum change in the 'number of vehicles' (dependent variable) per unit increase.

### Question 4. If ln(odds) of an event is 0, what is the probability of that event?

#### Option a is the answer (0)

### Question 5. To predict whether a heart attack is fatal, logistic regression is fitted. Y = 1, if the attack is fatal, 0 otherwise. The following model is found to be adequate = -8.5 + 0.2*Age + 0.15*Smoking Status [here 'ln' stands for natural logarithm (i.e. logarithm to the base )] Where Smoking Status = 1 if the person is a current smoker and 0 otherwise. Find the percentage probability that a 50-year-old non-smoker will have a fatal attack.

#### Option b is the answer (81.75)